
//К сожалению не успел закончить вовремя но добавил в список чтобы проверить свою логику

public class Start {
    public static void main(String[] args) {

        double a = args[0];
        double b = args[1];


//Для начала необходимо описать каждую опирацию
        // Буду пока описывать свою логику и двигаться по ступеням не факт что будет правильно но тип как будет
        public void Sum () {
            System.out.println(a + b);
//        Класс отвечающий за сложение
        }
        public void Vil () {
            System.out.println(a - b);
//            Класс отвечающий за вычитания
        }
        public void Expound () {
            System.out.println(a * b);
//            Класс отвечающий за умножение
        }
        public void Droed () {

            System.out.println(a / b);
//            Класс отвечающий за деление
        }
        public void Step () {
            System.out.println(a ^ b);
//            Класс отвечающий за возведение в степень
        }
        public void Sqwert () {
            System.out.println(sqrt(a));
//            Класс отвечающий за извлечение квадратного корня
        }
/*        Идея такая пользователь вводит число А нажимает "кнопку" которая будет обращаться к классу
 который будет выполнять необходимую функцию деление сложение вычитание итд числа А с число Б лио просто
 будет возводить в степень число А
 */


    }


}
