public class Start {
    public static void main(String[] args){
        double A = ;





//Для начала необходимо описать каждую опирацию
        // Буду пока описывать свою логику и двигаться по ступеням не факт что будет правильно но тип как будет
        public void Sum(){

//        Класс отвечающий за сложение
        }
        public void Vil(){
//            Класс отвечающий за вычитания
        }
        public void Expound(){
//            Класс отвечающий за умножение
        }
        public void Droed(){
//            Класс отвечающий за деление
        }
        public void Step(){
//            Класс отвечающий за возведение в степень
        }
        public void Sqwert(){
//            Класс отвечающий за извлечение квадратного корня
        }
/*        Идея такая пользователь вводит число А нажимает "кнопку" которая будет обращаться к классу
 который будет выполнять необходимую функцию деление сложение вычитание итд числа А с число Б лио просто
 будет возводить в степень число А
 */






    }


}
